pages/4_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Text Based Games</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Text Based Games</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-CS-TextGames">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="homework.html">Homework</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Hangman</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">

<ul class="org-ul">
<li>In this lesson you're going to create a version of hangman, that you can play against the computer.
</li>
<li>We are going to use <b>decompostion</b> to break down the problem into small solvable tasks.
</li>
<li>Each those small tasks will be then <b>implemented</b> as a <b>function</b>
</li>
<li>Let's have a little look at the logic of the game.
<ol class="org-ol">
<li>The word should be displayed with <code>_</code> in place of each letter.
</li>
<li>The player should guess a letter.
</li>
<li>If the letter is in the word, then the <code>_</code> should be replaced with the letter, and we should store how many correct letters the player has guessed (This takes into account repeats).
</li>
<li>If the letter is not in the word, then the gallows can begin to be drawn.
</li>
<li>The player should be asked for another letter.
</li>
<li>The game ends when the player has made correct guesses that equal the length of the word, or the last stage of the gallows has been drawn.
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 code">
<h3 id="sec-1-2">Code It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Lets start with the simplest and fun task of all - create and display the gallows.
</li>
<li>You are going to create the gallows by finishing off the stages below.
</li>
<li>The task of <b>display</b> the gallows will be implemented using a <b>function</b>
</li>
<li>We need to use ASCII characters to create the graphic that is displayed on the screen.
</li>
<li>We'll assign variables to have the values of the graphic.
</li>
<li>The first couple have been done for you in the code below.
</li>
<li>In python we use ='''= to print multi-line strings.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">stage0=''
stage1 = '''
_______________'''
stage2 = '''
|
|
|
|
|
|
|\______________'''
stage3 = '''
__________
|/
|
|
|
|
|
|\______________'''
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 try">
<h3 id="sec-1-3">Try It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Use ASCII to create the rest of the stages. The number of stages you have is obviously up to you.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 code">
<h3 id="sec-1-4">Code It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Now that you have all the stages of the hangman graphic, we need a way of easily printing out a specific stage as the game progresses.
</li>
<li>Probably the best way of doing this is to use a list.
<div class="org-src-container">

<pre class="src src-python">stage = [stage0,stage1,stage2,stage3,stage4,stage5,stage6,stage7,stage8]
</pre>
</div>
</li>
<li>the above list variable <b>stage</b> has 9 elements/items in it. Yours may be different depending on your own gallow design.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 try">
<h3 id="sec-1-5">Try It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Each item in the stage list has a position number called <code>index</code>
</li>
<li>To get stage4, you use <code>stage[4]</code>
</li>
<li>Let's try printing out some stages from your game.
</li>
<li>Save you file as <code>Hangman.py</code> and then run it.
</li>
<li>Switch over to the <code>interpreter</code> and then try accessing various stages of your graphic in the following way.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">print(stage[4])
</pre>
</div>
<ul class="org-ul">
<li>If you need more help with this task, have a look at <a href="https://www.bournetocode.com/projects/CS-PythonKeySkills/pages/1_Part.html#sec-1-4">this</a>
</li>
<li>Make sure that each of your stages print out correctly.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3 key">
<h3 id="sec-1-6">Key Points Check 1 - tick if you have done the item</h3>
<div class="outline-text-3" id="text-1-6">
<div class='checkItem'>
<input type='checkbox'> You have created all the ASCII art stages<br>
<input type='checkbox' > You have created a list variable <em>stage</em> that has all the stage variables<br>
<input type='checkbox' > You have checked each stage can be printed out correctly<br>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 code">
<h3 id="sec-1-7">Code It</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>As in real game play, we need to:
<ul class="org-ul">
<li>come up with a word for the game
</li>
<li>Ask the player for a guess
</li>
<li>keep track of the number of failed guesses. This can be achieved by using a variable
</li>
<li>keep track of correctly guessed letters.  This means we need to store the correct guessed letters. Everytime the player guessed correctly, we add the letter to the list of guessed letters.
</li>
<li>We need to create a list and append the correctly guessed letter to the list.
</li>
</ul>
</li>
<li>add to your existing Hungman.py code:

<div class="org-src-container">

<pre class="src src-python"># create an empty list
word= "hello"
numOfAttempts = 0
correctLetters = []

playerGuess = input ("Guess a letter: ")
</pre>
</div>
<ul class="org-ul">
<li>check if playerGuess is one of the letters in the word, if it is, add it to the correctLetters list, otherwise we need to add 1 to the numOfAttempts.
<div class="org-src-container">

<pre class="src src-python">if playerGuess in word:
    correctLetters.append(playerGuess)
else:
    numOfAttempts += 1
</pre>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3 learn">
<h3 id="sec-1-8">Learn It</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Now we are going to use <b>decomposition</b> skill from our problem solving unit to tackle another problem.
</li>
<li>We are going to implement the solvable small task as a function
</li>
<li>Functions are blocks of code that perform a specific task - in this case, a function to display the stage ASCII art for a given index.
</li>
<li>the idea is when a user pick the wrong letter in the game for the certain number of time, the corresponding stage is displayed.
</li>
<li>In Python we create a function using the keyword <code>def</code> followed by the function name.
</li>
<li>Add to your Hungam.py code the following:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"># define the function

def displayStage(numOfAttempts):
    print(stages[numOfAttempts])
</pre>
</div>
<ul class="org-ul">
<li>the above function only performs one thing - to print out the appropriate gallow depending on how many failed attempts the player current has.
</li>
<li>the variable <b>numOfAttempts</b> is called a parameter to the function - our function displayStage needs in order to print out the correct gallow stage.
</li>
<li>a function is not going to perform its designed task UNTIL it is being called.
</li>
<li>to call a function, you simply refer to its name and supply the neccessary parameters:
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"># call the function to actually use it
# numOfAttempts is called parameter

displayStage(numOfAttempts)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3 test">
<h3 id="sec-1-9">Test It</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Run your code to make sure it works
</li>
<li>So far failed attempts should lead to display different stage while successful guess will not advance the stages.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3 silver">
<h3 id="sec-1-10">Badge It - Silver</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>complete the above steps so that:
<ul class="org-ul">
<li>you have create the variable numOfAttempts, word and a list called guessedLetter.
</li>
<li>a player can input a letter.
</li>
<li>you have added the displayStage function to your code.
</li>
<li>Tested your code and you should see the correct stage is printed for failed and successdful guesses.
</li>
<li>Upload your code to www.bournetocode.com.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3 code">
<h3 id="sec-1-11">Code It</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Next, we will create another function to perform another specific task for us, that is to print out the word that the user is guessing. If a letter has been guessed, then it should be displayed, otherwise we should display an <code>_</code>.
</li>
<li>We'll start by giving the function a name.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">def displayWord():
</pre>
</div>
<ul class="org-ul">
<li>The first thing the function should do is:
<ol class="org-ol">
<li>Declare a variable called <code>display</code> and assign it the value of an empty string =''=
</li>
<li>For every letter in the word, we add a "_ " to the <b>display</b> variable to form a single string that is a underscore followed by a space to make easy reading.
</li>
<li><b><b>NOTE:</b></b> the function should be defined before it is called. Place your function definition just after the line where you created the empty list correctLetters.
</li>
</ol>
</li>
</ul>

<iframe src="https://trinket.io/embed/python/9a2bff2d03" width="100%" height="300" frameborder="0" marginwidth="0" marginheight="0" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3 test">
<h3 id="sec-1-12">Test It</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>Add the above code to your Hungman.py
</li>
<li>Run your program and check your code works.
</li>
<li>You should see 5 =_ = characters printed.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-13" class="outline-3 key">
<h3 id="sec-1-13">Key Points Check 2 - tick if you have done the item</h3>
<div class="outline-text-3" id="text-1-13">
<div class='checkItem'>
<input type='checkbox'> You have passed the key points check 1<br>
<input type='checkbox' > You have a function called <em>displayStage</em> and you have tested it works<br>
<input type='checkbox' > You have another function called <em>displayWord</em> and you have tested it works<br>
</div>
</div>
</div>


<div id="outline-container-sec-1-14" class="outline-3 code">
<h3 id="sec-1-14">Code It</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>The next step is to make the function * displayWord* more intelligent.
<ul class="org-ul">
<li>it will check if each letter in the word is in the correctLetters list
</li>
<li>if it is, it will add it to the display string, else it will add a "_ "
</li>
</ul>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">def displayWord():
  display = ""

  for letter in word:
    if letter not in correctLetters:
      display += "- "
    else: 
       display += letter

  print(display)
</pre>
</div>
<ul class="org-ul">
<li>Save your updated file
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-15" class="outline-3 key">
<h3 id="sec-1-15">Key Points Check 3 - tick if you have done the item</h3>
<div class="outline-text-3" id="text-1-15">
<div class='checkItem'>
<input type='checkbox'> You have passed the key points check 1 and 2<br>
<input type='checkbox' > You have updated your displayWord function as instructed above<br>
<input type='checkbox' > Your code structured in the following order<br>
</div>

<ul class="org-ul">
<li>variables and lists are defined at the start
</li>
<li>followed by the two functions definitions
</li>
<li>followed by playerGuess input
</li>
<li>then, the if statement for checking if the playerGuess is in the word
</li>
<li>followed by the two function calls to the displayWord and displayStage
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-16" class="outline-3 gold">
<h3 id="sec-1-16">Badge It - Gold</h3>
<div class="outline-text-3" id="text-1-16">
<ul class="org-ul">
<li>Once you have finished the above code and tested it works, upload your work and upload your code to www.bournetocode.com
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-17" class="outline-3 learn">
<h3 id="sec-1-17">Learn It</h3>
<div class="outline-text-3" id="text-1-17">
</div>
</div>

<div id="outline-container-sec-1-18" class="outline-3 platinum">
<h3 id="sec-1-18">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-1-18">
<ul class="org-ul">
<li>Our game so far only allows player to have one go.
</li>
<li>We need to keep asking the player to guess until:
<ol class="org-ol">
<li>Either the player has guessed all letters before the final stage, 
</li>
<li>Or, the numOfGuesses has reached the maximum number of stages you have. 
</li>
</ol>
</li>
<li>We are going to use a Boolean variable <code>gameOn</code> to indicate if we need to ask the player for more guesses or not.
</li>
<li>Use a while loop to keep asking the player to guess if gameOn is True
</li>

<li>The basic concept will be:
<ol class="org-ol">
<li>If the length of the word being guessed is equal to the value of <code>correctLetters</code> then we can print out the current stage, and a message that the player has won, and finally change the <code>gameOn</code> variable to False.
</li>
<li>If the <code>numOfAttempts</code> is equal to 8 (or whatever the final stage you have, then we should print out the current stage, send a message that the player has lost, and then set <code>gameOn</code> to false.
</li>
</ol>
</li>
<li>Try to improve your game so the above logic will be implemented
</li>
<li>When you have done and tested your function worked, upload your code to www.bournetocode.com.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
